@echo off
cls


title Neoscript Xcompile
chcp 65001>nul
echo -----------------------------------------------------------------------------------------------------------------------------------------------        
echo [91m███    ██ ███████  ██████  ███████  ██████ ██████  ██ ██████  ████████     ██   ██  ██████  ██████  ███    ███ ██████  ██ ██      ███████ 
echo [91m████   ██ ██      ██    ██ ██      ██      ██   ██ ██ ██   ██    ██         ██ ██  ██      ██    ██ ████  ████ ██   ██ ██ ██      ██      
echo [91m██ ██  ██ █████   ██    ██ ███████ ██      ██████  ██ ██████     ██          ███   ██      ██    ██ ██ ████ ██ ██████  ██ ██      █████   
echo [91m██  ██ ██ ██      ██    ██      ██ ██      ██   ██ ██ ██         ██         ██ ██  ██      ██    ██ ██  ██  ██ ██      ██ ██      ██      
echo [91m██   ████ ███████  ██████  ███████  ██████ ██   ██ ██ ██         ██        ██   ██  ██████  ██████  ██      ██ ██      ██ ███████ ███████ 
echo ---------------------------------------------------------------------------------------------------------------------------------------------                                                                                                                                          
                                                                                                                                          

                                                                                                                                                                                  

echo Testing Color: [91mRed[0m >nul
:: 1. Validate Input
if "%~1" == "" echo Error: No filename provided.& goto :eof
if not exist "%~1" echo File not found: %~1& goto :eof

set "filename=%~1"

:: 2. Check for Silent / CompileOnly flags in arguments 2 or 3
echo "%~2 %~3" | findstr /i /c:"--Silent" /c:"--CompileOnly"  >nul
if %errorlevel% equ 0 goto :Silent
if "%~4" == "-Developer" goto :dev

:NotSilent
timeout /t 2 >nul
echo Compiling %filename%...
echo.

bckend "%filename%"
echo [92mSuccess! The file %filename% has been compiled successfully. with exit code %errorlevel%.[0m
goto :eof

:Silent
echo Warning: Silent mode will hide all output during compilation.
echo Press any key to continue or Ctrl+C to cancel.
pause >nul
bckend "%filename%" >nul 2>&1
goto :eof


:dev
echo Starting Neoscript Developer Mode...
echo.
echo.
echo ███    ██ ███████  ██████  ███████  ██████ ██████  ██ ██████  ████████     ██████  ███████ ██    ██ ███████ ██       ██████  ██████  ███████ ██████      ███    ███  ██████  ██████  ███████ 
echo ████   ██ ██      ██    ██ ██      ██      ██   ██ ██ ██   ██    ██        ██   ██ ██      ██    ██ ██      ██      ██    ██ ██   ██ ██      ██   ██     ████  ████ ██    ██ ██   ██ ██      
echo ██ ██  ██ █████   ██    ██ ███████ ██      ██████  ██ ██████     ██        ██   ██ █████   ██    ██ █████   ██      ██    ██ ██████  █████   ██████      ██ ████ ██ ██    ██ ██   ██ █████   
echo ██  ██ ██ ██      ██    ██      ██ ██      ██   ██ ██ ██         ██        ██   ██ ██       ██  ██  ██      ██      ██    ██ ██      ██      ██   ██     ██  ██  ██ ██    ██ ██   ██ ██      
echo ██   ████ ███████  ██████  ███████  ██████ ██   ██ ██ ██         ██        ██████  ███████   ████   ███████ ███████  ██████  ██      ███████ ██   ██     ██      ██  ██████  ██████  ███████ 
echo.
echo.                                                                                                                                                                                             
                                                                                                                                                                                             
